&НаСервере
Процедура ПоместитьФайлОбъекта(Адрес)
	Спр=РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные=ПолучитьИзВременногоХранилища(Адрес);
	Спр.Картинка=Новый ХранилищеЗначения(ДвоичныеДанные);
	Спр.Записать();
	АдресКартинки=Адрес;
	ЗначениеВРеквизитФормы(Спр,"Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьВыполнить()
	Перем Адрес;
	Если ПоместитьФайл(Адрес,"",,Истина,ЭтаФорма.УникальныйИдентификатор) Тогда
		ПоместитьФайлОбъекта(Адрес);
		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Спр=РеквизитФормыВЗначение("Объект");
	Если Спр.Картинка.Получить()<>Неопределено Тогда
		АдресКартинки=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Картинка"); 
	КонецЕсли;
КонецПроцедуры
