Функция ПредставлениеДаты(ПД) Экспорт
	Возврат(Формат(ПД,"ДЛФ=ДД"));		
КонецФункции	

Функция СериализоватьРезультат(Объект,ИмяФайла) Экспорт
	СР=Новый СериализаторXDTO(ФабрикаXDTO);
	Запись=Новый ЗаписьXML;
	Путь=Константы.ПутьДоКаталога.Получить();
	Запись.ОткрытьФайл(Путь+"\"+ИмяФайла+".xml");
	СР.ЗаписатьXML(Запись,Объект,НазначениеТипаXML.Явное);
	Запись.Закрыть();
КонецФункции

Функция ПолучитьИзXML(ИмяФайла) Экспорт
	СР=Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение=Новый ЧтениеXML;
	Путь=Константы.ПутьДоКаталога.Получить();
	Чтение.ОткрытьФайл(Путь+"\"+ИмяФайла+".xml");
	Объект=СР.ПрочитатьXML(Чтение);
	Чтение.Закрыть();
	Возврат(Объект);
	
КонецФункции

Функция ФОМ_ПривестиКТитульномуРегистру(Параметр) Экспорт
	
	Возврат(ТРег(Параметр));	
	
КонецФункции	

Функция ПолучитьПодписьКОтчету() Экспорт
	Возврат("Отчет сформирован: "+ПредставлениеДаты(ТекущаяДата())+", Пользователь П.П.");	
КонецФункции	