
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЛоготип(Команда)
	Перем Адрес;
	Если ПоместитьФайл(Адрес,"",,Истина,ЭтаФорма.УникальныйИдентификатор) Тогда
		Картинка=Адрес;
		ИзменитьЛоготипНаСервере();
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ИзменитьЛоготипНаСервере()
	ДвоичныеДанные=ПолучитьИзВременногоХранилища(Картинка);
	ХЗ=Новый ХранилищеЗначения(ДвоичныеДанные);
	МЗ=РегистрыСведений.ИспользуемыеКартинки.СоздатьМенеджерЗаписи();
	МЗ.ВидКартинки=Перечисления.ВидыКартинок.ЛоготипМалый;
	МЗ.ДДКартинки=ХЗ;
	МЗ.Записать(Истина);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отбор=Новый Структура("ВидКартинки",Перечисления.ВидыКартинок.ЛоготипМалый); 
	Запись=РегистрыСведений.ИспользуемыеКартинки.Получить(Отбор);
	Картинка1=Запись.ДДКартинки.Получить();
	Картинка=ПоместитьВоВременноеХранилище(Картинка1,ЭтаФорма.УникальныйИдентификатор);
		//Картинка=ПолучитьНавигационнуюСсылку(Константы,"ЛоготипКомпании"); 
КонецПроцедуры

